#+TITLE: MCX or probabilistic programming via source code rewriting
#+DATE: <2020-02-12 Wed>
#+AUTHOR: Rémi Louf

Designing a user-friendly API for a Probabilistic Programming Language (PPLs) is
cursed by the deceiving simplicity of the mathematical representation of
graphical models. Take a simple Beta-Binomial model:

#+begin_src latex :results raw :exports results
\begin{align*}
p &\sim \operatorname{Beta}(1, 2)\\
b &\sim \operatorname{Binomial}(p)
\end{align*}
#+end_src

#+RESULTS:
\begin{align*}
p &\sim \operatorname{Beta}(1, 2)\\
b &\sim \operatorname{Binomial}(p)
\end{align*}

Looking at these equations you are able to comprehend what they represent, and
their consequences. But these equations are only *descriptive*, they do not allow us to
compute anything. To manipulate these models in a useful way we need to extract
at least two different representations of this object: one that draws samples
form the prior joint distribution, and the log-probability density function. We
have a one-to-many relationship between the notation and what we need from it in
practice, and this one-to-many relationship is not trivial to implement in
programming languages.

Of course we can implement these two representations separately. This is simple to do
with "elementary" distributions like the Beta, Dirichlet, Multivariate Normal,
etc. distributions. As a matter of fact, they are often implemented as a single object that
implements a =sample= and a =logpdf= method. So when you write:

#+begin_src python
x = Beta(1., 1.)
#+end_src

You can draw realizations from this random variable with =x.sample()= or compute
the log-probability of x having the value =a= as =x.logpdf(a)=. The notation
mirrors that of =x ~ Beta(1., 1.)=.

But it becomes more tedious with complex graphical models. You can always
implement each model as a class, say =BetaBinomial= for the Beta-Binomial model
above. But then you are building a model zoo, not a language in which the models
can be expressed.

#+begin_src python
def regression(X):
  alpha = Normal(0, 10)
  beta = Normal(np.zeros(5), 10)
  sigma = HalfNormal(1)

  y = alpha + np.dot(beta, X)
  predictions = Normal(y, sigma)

  return predictions
#+end_src

What we would like is a language that allows us to manipulate random variables,
write models as functions of these variables. And once the model is defined, to
be able to sample from its joint prior and posterior distributions. At the very
least, it should give you a sampling function and a function that computes the
log-probability for every position in the state-space. That is what
probabilistic programming is about.

We would like a language that allows us to combine such elementary
distributions, just like above, into an object that gives us its logpdf and
sampling distribution. If we can do that, we can express any model that is a
combination of these elementary distributions, sample from its prior and
posterior distribution. That's what probabilistic programming is about.

But programming languages are different: one set of instructions does one thing
and only one. I can probably write a programme like the one above that would
give me predictive samples. But then I wouldn’t have the logpdf. There is thus a
tension between the mathematical notations and the programming language.

This is a problem of two languages: how do you express in a programming language
an abstract way of defining models?

In practice PPLs have different ways to resolve this tension: some build a
graph, some use effect handlers (I recommend Junpeng's [talk at PyCordoba]() on
PPLs). MCX's stance is much like Stan's: what if we created our own language,
close to the mathematical expression, that can then be compiled in a logpdf and
a sampling function?

Unlike Stan, MCX is embedded in Python. We would like to benefit from Python's
automatic differentiation, acceleration and array manipulation libraries. We
would also like to integrate with Python's still budding machine learning
ecosystem. MCX should thus be a superset a python: allow every operation python
allows, but somehow accomodate random variable assignments. Having posed the
problem in these terms there is only one solution: defining a new syntax and
modify this syntax at runtime using Python's introspection abilities.

You want to reason about an abstract object, the model, without having to
interact with it at a higher level. You want to be able to "sample from its
posterior distribution", "sample from its prior predictive distribution".

